In [1]:
import pandas as pd

### Pandas Set Index | pd.DataFrame.set_index()
We will run through 3 examples:
1. Setting a new index from an existing column
2. Setting a new index from an new np.array
3. Setting a new index with append=True so we create a multi index

But first, let's create our DataFrame

In [2]:
df = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30)],
           columns=('name', 'type', 'AvgBill')
                 )
df

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

Next I'm going to set my index as the "name" column in my DataFrame.

### Setting a new index from an existing column

In [3]:
df.set_index('name')

                      type  AvgBill
name
Foreign Cinema  Restaurant    289.0
Liho Liho       Restaurant    224.0
500 Club               bar     80.5
The Square             bar     25.3

Check it out! My name column has now become my index. Also notice that the 'name' column has been dropped from our original dataframe. If we set drop=False then it would have stayed and also replaced the index.

### Setting a new index from an new np.array
Now I'm going to set my index, but in this case, instead of a DataFrame column I'm going to create a new list from scratch to be the new index.

**Warning:** Make sure to use a pd.Series or a np.ndarray when you pass it to set_index. A simple list won't work.

In [4]:
df.set_index(pd.Series(["MyRes1","MyRes2","MyRes3","MyRes4"]))

                  name        type  AvgBill
MyRes1  Foreign Cinema  Restaurant    289.0
MyRes2       Liho Liho  Restaurant    224.0
MyRes3        500 Club         bar     80.5
MyRes4      The Square         bar     25.3

Now my indexes are set to the creatively named pd.Series I passed.
### Setting a new index with append=True so we create a multi index

Now I'm going to set append=True. This will set the new index I'm supplying *as well as* keep the old one. Previously the old one was dropped.

In [5]:
df.set_index(pd.Series(["MyRes1","MyRes2","MyRes3","MyRes4"]), append=True)

                    name        type  AvgBill
0 MyRes1  Foreign Cinema  Restaurant    289.0
1 MyRes2       Liho Liho  Restaurant    224.0
2 MyRes3        500 Club         bar     80.5
3 MyRes4      The Square         bar     25.3